{"basics":{"name":"Mikel Larrea","label":"Researcher","image":"","email":"m.larrea@ehu.eus","url":"https://LarreaMikel.github.io/al-folio/","summary":"UPV/EHU Lecturer in Control Systems and Automation Engineering. My research interests include Intelligent Control, Neural Networks, and Multi-Objective Optimization.","location":{"address":"Faculty of Engineering, Europa Plaza 1","postalCode":"20018","city":"Donostia-San Sebastián","countryCode":"ES","region":"Gipuzkoa"},"profiles":[{"network":"Orcid","username":"Mikel Larrea","url":"https://orcid.org/0000-0002-9223-9355"}]},"work":[{"name":"Faculty of Engineering, University of the Basque Country (UPV/EHU)","position":"Lecturer in Control Systems and Automation Engineering","url":"https://www.ehu.eus/en/web/gipuzkoako-ingeniaritza-eskola/faculty-engineering-gipuzkoa","startDate":"2017","endDate":"Actual","summary":"Teaching in Control Systems and Automation Engineering, Robotics and more.","highlights":["Control Systems","Digital Electronics"]}],"publications":[{"name":"Estudio de las Redes PINN como modelos de sistemas dinámicos","publisher":"Simposios del Comité Español de Automática (CEA)","releaseDate":"2025-01-01","url":"doi.org/10.64117/simposioscea.v1i2.88","summary":"Studies Physics-Informed Neural Networks (PINN) as alternative models to represent and analyze dynamic systems."},{"name":"Modelos de ensamblaje con redes neuronales para la identificación de sistemas","publisher":"XLVI Jornadas de Automática","releaseDate":"2025-01-01","url":"doi.org/10.17979/ja-cea.2025.46.12205","summary":"Proposes the use of neural networks to assemble partial models for system identification, improving accuracy and generalization."},{"name":"Review of Aerial Transportation of Suspended-Cable Payloads with Quadrotors","publisher":"Drones","releaseDate":"2024-01-01","url":"doi.org/10.3390/drones8020035","summary":"Comprehensive review on aerial transportation of suspended loads using quadrotor drones, including dynamics, control strategies, and recent research trends."},{"name":"A Narrative Review of Haptic Technologies and Their Value for Training, Rehabilitation, and the Education of Persons with Special Needs","publisher":"Sensors","releaseDate":"2024-01-01","url":"doi.org/10.3390/s24216946","summary":"Narrative review of haptic technologies applied to special education, rehabilitation, and training, highlighting human–computer interaction approaches."},{"name":"Control of MIMO Systems with iMO-NMPC Strategy","publisher":"Springer Nature Switzerland","releaseDate":"2023-01-01","url":"","summary":"Extends the intelligent Multi-Objective Nonlinear Model Predictive Control (iMO-NMPC) strategy to MIMO systems, validating performance and robustness through simulations."},{"name":"Desarrollo de la estrategia iMO-NMPC: primeros pasos para su implementación en dispositivos industriales","publisher":"XLIII Jornadas de Automática","releaseDate":"2022-01-01","url":"hdl.handle.net/2183/31387","summary":"Describes the methodology for implementing intelligent control strategies, such as iMO-NMPC, on industrial platforms using automatic code generation."},{"name":"Extreme learning machine ensemble model for time series forecasting boosted by PSO: Application to an electric consumption problem","publisher":"Neurocomputing","releaseDate":"2021-01-01","url":"doi.org/10.1016/j.neucom.2019.12.140","summary":"Proposes an ensemble model based on Extreme Learning Machines optimized with PSO for time series forecasting, applied to electric consumption prediction."},{"name":"A Low-Cost, Portable Solution for Stress and Relaxation Estimation Based on a Real-Time Fuzzy Algorithm","publisher":"IEEE Access","releaseDate":"2020-01-01","url":"doi.org/10.1109/ACCESS.2020.2988348","summary":"Develops a low-cost, portable solution for real-time stress and relaxation estimation using a fuzzy algorithm."},{"name":"A PSO Boosted Ensemble of Extreme Learning Machines for Time Series Forecasting","publisher":"Springer International Publishing","releaseDate":"2019-01-01","url":"","summary":"Presents an initial approach using the PSO algorithm to optimize ensemble models based on Extreme Learning Machines for time series forecasting."},{"name":"About Extracting Dynamic Information of Unknown Complex Systems by Neural Networks","publisher":"Complexity","releaseDate":"2018-01-01","url":"doi.org/10.1155/2018/3671428","summary":"Proposes a methodology to extract dynamic information from unknown complex systems using neural networks and equilibrium point analysis."},{"name":"Real time direct kinematic problem computation of the 3PRS robot using neural networks","publisher":"Neurocomputing","releaseDate":"2018-01-01","url":"doi.org/10.1016/j.neucom.2017.02.098","summary":"Uses neural networks to solve the direct kinematic problem of a 3PRS parallel robot in real time, optimizing accuracy and computational performance."},{"name":"Implementation and testing of a soft computing based model predictive control on an industrial controller","publisher":"Journal of Applied Logic","releaseDate":"2014-01-01","url":"doi.org/10.1016/j.jal.2014.11.005","summary":"Presents a real-time implementation of a model predictive controller based on soft computing techniques on an industrial controller."},{"name":"Primeros resultados de un control genetico predictivo sobre maqueta de helicoptero (twinrotor)","publisher":"XXXV Jornadas de Automática","releaseDate":"2014-01-01","url":"","summary":"Presents initial results of a genetic predictive controller applied to a twin-rotor helicopter model."},{"name":"Soft computing testing in real industrial platforms for process intelligent control","publisher":"Advances in Intelligent Systems and Computing","releaseDate":"2013-01-01","url":"scopus.com/inward/record.url?eid=2-s2.0-84868286501","summary":"Evaluates the behavior of soft computing techniques in industrial platforms for intelligent process control."},{"name":"Prototipado rápido para el desarrollo y evaluación de controladores inteligentes sobre plataformas industriales en tiempo real","publisher":"VIII Simposio CEA de Control Inteligente","releaseDate":"2012-01-01","url":"","summary":"Describes a rapid prototyping system for testing intelligent controllers on industrial platforms running in real time."},{"name":"Intelligent Multi-Objective Nonlinear Model Predictive Control (iMO-NMPC): Towards the ‘on-line’ optimization of highly complex control problems","publisher":"Expert Systems with Applications","releaseDate":"2012-01-01","url":"doi.org/10.1016/j.eswa.2011.12.052","summary":"Proposes a multi-objective nonlinear model predictive control scheme combining neural networks, genetic algorithms, and fuzzy systems."},{"name":"Nonlinear system control based on Neural Networks with Adaptive Predictive strategy","publisher":"Emerging Technologies and Factory Automation (ETFA), 2010 IEEE Conference on","releaseDate":"2010-09-01","url":"doi.org/10.1109/ETFA.2010.5641348","summary":"Presents an adaptive predictive control strategy based on neural networks applied to nonlinear systems."},{"name":"A Hybridized neuro-genetic solution for controlling industrial R^3 workspace","publisher":"Neural Network World","releaseDate":"2010-01-01","url":"nnw.cz/obsahy10.html","summary":"Proposes a hybrid neuro-genetic controller for managing three-dimensional industrial workspaces."},{"name":"A Neuro-genetic Control Scheme Application for Industrial R^3 Workspaces","publisher":"Springer Berlin / Heidelberg","releaseDate":"2010-01-01","url":"doi.org/10.1007/978-3-642-13769-3_42","summary":"Describes the application of a neuro-genetic control scheme to three-dimensional industrial workspaces."},{"name":"Adding Nonlinear System Dynamics to Levenberg-Marquardt Algorithm for Neural Network Control","publisher":"Springer Berlin / Heidelberg","releaseDate":"2010-01-01","url":"doi.org/10.1007/978-3-642-15825-4_47","summary":"Proposes an extension of the Levenberg-Marquardt algorithm to include nonlinear system dynamics during neural controller training."},{"name":"Esquema de Control Adaptativo-Predictivo basado en Redes Neuronales","publisher":"VI Simposio de Control Inteligente","releaseDate":"2010-01-01","url":"","summary":"Presents an adaptive predictive control scheme based on neural networks for nonlinear dynamic systems."},{"name":"Control Adaptativo-Predictivo de sistemas no-lineales mediante Redes Neuronales","publisher":"V Simposio de Control Inteligente","releaseDate":"2009-01-01","url":"","summary":"Develops an adaptive predictive controller using neural networks for the control of nonlinear systems."},{"name":"Una revisión del Estado del Arte en el diseño de RNAŽs mediante AGŽs","publisher":"VI Congreso Español sobre Metaheurísticas, Algoritmos Evolutivos y Bioinspirados","releaseDate":"2009-01-01","url":"","summary":"State-of-the-art review on the use of genetic algorithms for designing artificial neural networks."},{"name":"Aplicación de Técnicas Neuro-Genéticas en la resolución del problema de control cinemático en un puente grúa","publisher":"XXIX Jornadas de Automática","releaseDate":"2008-01-01","url":"cea-ifac.es/actividades/jornadas/XXIX/pdf/255.pdf","summary":"Proposes a kinematic control solution for an overhead crane using neuro-genetic techniques for multi-objective optimization."},{"name":"Una Metodología De Bajo Coste Computacional Para El Control Predictivo De Sistemas No Lineales Mediante Redes Neuronales","publisher":"XXVII Jornadas de Automática","releaseDate":"2006-01-01","url":"","summary":"Proposes an efficient low-computational-cost methodology for nonlinear predictive control using neural networks."}],"skills":[{"name":"Engineering","level":"PhD","icon":"fa-solid fa-hashtag","keywords":["Intelligent Control","Neural Networks","Predictive Control","Multiobjective Optimization"]}],"languages":[{"language":"Basque","fluency":"Native speaker","icon":""},{"language":"Spanish","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}],"interests":[{"name":"Robotics","icon":"fa-solid fa-tag","keywords":["ROS2","Autonomous Vehicles","Artificial Vision","Drones"]}],"projects":[{"name":"MODELIZACIÓN DE PROCESOS INDUSTRIALES CON DINÁMICAS COMPLEJAS PARA SU APLICACIÓN EN NOVEDOSAS ESTRATEGIAS DE CONTROL PREDICTIVO","summary":"Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers.","highlights":["NMPC","Multiobjective Optimization","Neural Networks"],"startDate":"2021-09-01","endDate":"2024-08-31","url":"https://www.ehu.eus/en/web/gici/proyectos/-/asset_publisher/2GsX/content/neopredicom-2?p_r_p_assetEntryId=35470909&_com_liferay_asset_publisher_web_portlet_AssetPublisherPortlet_INSTANCE_2GsX_type=content&_com_liferay_asset_publisher_web_portlet_AssetPublisherPortlet_INSTANCE_2GsX_urlTitle=neopredicom-2&_com_liferay_asset_publisher_web_portlet_AssetPublisherPortlet_INSTANCE_2GsX_redirect=https%3A%2F%2Fwww.ehu.eus%3A443%2Fen%2Fweb%2Fgici%2Fproyectos%3Fp_p_id%3Dcom_liferay_asset_publisher_web_portlet_AssetPublisherPortlet_INSTANCE_2GsX%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_r_p_assetEntryId%3D35470909%26_com_liferay_asset_publisher_web_portlet_AssetPublisherPortlet_INSTANCE_2GsX_cur%3D0%26p_r_p_resetCur%3Dfalse"}]}